Jmeter/Wspace/Generate HTML Report/View Results Tree/statistics.json
{
  "HTTP Request-https-www.google.com-/search?q=mulesoft" : {
    "transaction" : "HTTP Request-https-www.google.com-/search?q=mulesoft",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 933.0,
    "medianResTime" : 933.0,
    "minResTime" : 933.0,
    "maxResTime" : 933.0,
    "pct1ResTime" : 933.0,
    "pct2ResTime" : 933.0,
    "pct3ResTime" : 933.0,
    "throughput" : 1.0718113612004287,
    "receivedKBytesPerSec" : 373.572313772776,
    "sentKBytesPerSec" : 0.14234994640943194
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 760.6666666666666,
    "medianResTime" : 776.0,
    "minResTime" : 573.0,
    "maxResTime" : 933.0,
    "pct1ResTime" : 933.0,
    "pct2ResTime" : 933.0,
    "pct3ResTime" : 933.0,
    "throughput" : 2.4174053182917006,
    "receivedKBytesPerSec" : 469.21664106567283,
    "sentKBytesPerSec" : 0.31791398066075743
  },
  "HTTP Request-https-www.google.com-/search?q=Github" : {
    "transaction" : "HTTP Request-https-www.google.com-/search?q=Github",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 573.0,
    "medianResTime" : 573.0,
    "minResTime" : 573.0,
    "maxResTime" : 573.0,
    "pct1ResTime" : 573.0,
    "pct2ResTime" : 573.0,
    "pct3ResTime" : 573.0,
    "throughput" : 1.7452006980802792,
    "receivedKBytesPerSec" : 193.0099940008726,
    "sentKBytesPerSec" : 0.22837587260034906
  },
  "HTTP Request-https-www.google.com-/search?q=Jmeter" : {
    "transaction" : "HTTP Request-https-www.google.com-/search?q=Jmeter",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 776.0,
    "medianResTime" : 776.0,
    "minResTime" : 776.0,
    "maxResTime" : 776.0,
    "pct1ResTime" : 776.0,
    "pct2ResTime" : 776.0,
    "pct3ResTime" : 776.0,
    "throughput" : 1.288659793814433,
    "receivedKBytesPerSec" : 158.71154155927834,
    "sentKBytesPerSec" : 0.16863321520618557
  }
}